In [21]:
import pandas as pd

In [22]:
tourism_df = pd.read_csv("../data/oecd_tourism.csv",
                 usecols= ['LOCATION',
                           'SUBJECT',
                           'TIME',
                           'Value'])
tourism_df

     LOCATION  SUBJECT  TIME      Value
0         AUS  INT_REC  2008  31159.800
1         AUS  INT_REC  2009  29980.700
2         AUS  INT_REC  2010  35165.500
3         AUS  INT_REC  2011  38710.100
4         AUS  INT_REC  2012  38003.700
...       ...      ...   ...        ...
1229      SRB  INT-EXP  2015   1253.644
1230      SRB  INT-EXP  2016   1351.098
1231      SRB  INT-EXP  2017   1549.183
1232      SRB  INT-EXP  2018   1837.317
1233      SRB  INT-EXP  2019   1999.313

[1234 rows x 4 columns]

In [23]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT_REC']
    ['Value']
    .mean()
)

np.float64(18876.11070502431)

In [24]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT_REC']
    .groupby('LOCATION')['Value']
    .mean()
)

LOCATION
AUS     38540.900000
AUT     21413.209091
BEL     12190.591636
BGR      4343.541417
BRA      6321.476083
CAN     24202.591667
CHE     16481.041667
CHL      3163.441667
CHN     43554.309417
COL      4778.975000
CRI      3174.100000
CZE      7909.922273
DEU     53408.570636
DNK      9398.957636
EGY      9850.430833
ESP     69655.817364
EST      1848.067364
FIN      4700.236273
FRA     65063.335727
GBR     51752.090909
GRC     16908.736000
HRV      9286.770000
HUN      7299.353000
IDN     11484.960000
IND     20606.844083
IRL     10535.157364
ISL      2397.367455
ISR      6542.383250
ITA     44930.211545
JPN     25015.858333
KAZ      1979.881333
KOR     17780.754545
LTU      1426.155556
LUX      5122.330727
LVA      1215.036364
MAR      8684.227500
MEX     16564.354545
MLT      1607.669250
NLD     20042.627273
NOR      5188.772727
NZL      9593.466667
PER      3596.176667
PHL      5910.688833
POL     12231.065182
PRT     16470.353909
ROU      2340.742833
RUS     16131.481818
SRB      1356.921333
SVK      2683.343727
SVN      2913.229364
SWE     13373.514000
TUR     31582.090909
USA    201613.500000
ZAF      9794.813167
Name: Value, dtype: float64

In [25]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT_REC']
    .groupby('LOCATION')['Value']
    .mean()
    .sort_values(ascending=False)
    .head()
)

LOCATION
USA    201613.500000
ESP     69655.817364
FRA     65063.335727
DEU     53408.570636
GBR     51752.090909
Name: Value, dtype: float64

In [26]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT-EXP']
    .groupby('LOCATION')['Value']
    .mean()
    .sort_values()
    .head()
)

LOCATION
MLT     387.801667
CRI     867.075000
LVA     919.545455
ISL    1072.819636
HRV    1115.628083
Name: Value, dtype: float64

In [27]:
locations_df = pd.read_csv('../data/oecd_locations.csv',
                           header=None,
                           names=['LOCATION', 'NAME'],
                           index_col='LOCATION')

locations_df.head()

               NAME
LOCATION
AUS       Australia
AUT         Austria
BEL         Belgium
CAN          Canada
DNK         Denmark

In [28]:
fullname_df = locations_df.join(tourism_df.set_index('LOCATION'))
fullname_df.head()

               NAME  SUBJECT  TIME    Value
LOCATION
AUS       Australia  INT_REC  2008  31159.8
AUS       Australia  INT_REC  2009  29980.7
AUS       Australia  INT_REC  2010  35165.5
AUS       Australia  INT_REC  2011  38710.1
AUS       Australia  INT_REC  2012  38003.7

In [29]:
(
    fullname_df
    .loc[fullname_df['SUBJECT'] == 'INT_REC']
    .groupby('NAME')['Value']
    .mean()
    .sort_values(ascending=False)
)

NAME
United States     201613.500000
France             65063.335727
Germany            53408.570636
United Kingdom     51752.090909
Italy              44930.211545
Australia          38540.900000
Japan              25015.858333
Canada             24202.591667
Austria            21413.209091
Korea              17780.754545
Belgium            12190.591636
Denmark             9398.957636
Hungary             7299.353000
Israel              6542.383250
Brazil              6321.476083
Finland             4700.236273
Name: Value, dtype: float64